import React from 'react'
import articleStyle from '../../styles/article.module.scss'

export default function AboutUs() {
    return (
        <main>
            <h1>درباره ما</h1>
            
            <p>لینوکسی‌ها یک بستر باز برای کاربران گنو/لینوکسی است که می‌خواهند مطالب خود را در آن منتشر کنند و علاوه بر کمک به کاربران دیگر، کسب درآمد نیز داشته باشند.</p>
            <p>ما از شما عزیزانی که با توزیع‌های لینوکس آشنایی دارید، دعوت می‌کنیم که جهت بالا بردن سطح کیفی و کمی مطالب با ما همکاری کنید. همچنین از وبلاگ نویسان حیطه لینوکس دعوت می‌کنیم که مطالب خود را در سایت لینوکسی‌ها منتشر کنند تا با توجه به امکانات خاص سایت مانند شبکه‌های اجتماعی، سئو قوی و … کاربران لینوکس بیشتری به مطالب شما دسترسی داشته باشند و از طریق انتشار مطالب نیز کسب درآمد داشته باشید.</p>
            <p>برای همکاری با ما کافیست یک اکانت از سایت <a className="link" href="https://github.com/" target="_blank">گیت‌هاب</a> داشته باشید و مراحل زیر را طی کنید.</p>
        </main>
    )
}
